---
kind: type
id: T:Autodesk.Revit.DB.WallSweepOrientation
source: html/c290c137-1e53-8d4e-588a-f52d8a62122c.htm
---
# Autodesk.Revit.DB.WallSweepOrientation

Represents the orientation of horizonally placed sweep's profile relative to the wall side face.

## Syntax (C#)
```csharp
public enum WallSweepOrientation
```